eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСМ/абс_ПоступлениеОСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПоступлениеОСМ</name>
  <basedOn>Document.ПринятиеКУчетуОС</basedOn>
  <basedOn>Document.МодернизацияОС</basedOn>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСМеждународный</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковОС</types>
      <types>DocumentRef.МодернизацияОС</types>
      <types>DocumentRef.ПринятиеКУчетуОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Местонахождение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеСчетовБУиМСФО/СоответствиеСчетовБУиМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеСчетовБУиМСФО</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетМеждународный</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Учитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитПредставление</name>
    <comment>Пользовательское представление реквизита</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетПравилПереносаСчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетХозрасчетный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженийБухгалтерии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСМеждународный/абс_СтоимостьОСМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСМеждународный</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДвиженийБухгалтерии/ВидыДвиженийБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийБухгалтерии</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дебет</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ПоступлениеОСМ/ManagerModule.bsl
Функция ПолучитьСтруктуруЗапросовПроведения(ТипДокументаОснования) Экспорт 
	
	СтруктураЗапросов = Новый Структура;
	
	ДобавитьОбщиеЗапросы1(СтруктураЗапросов);
	
	Если ТипДокументаОснования = Тип("ДокументСсылка.ПринятиеКУчетуОС") Тогда 
		ДобавитьЗапросыДляПоступление_Принятие(СтруктураЗапросов);
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.МодернизацияОС") Тогда 	
		ДобавитьЗапросыДляПоступление_Модернизация(СтруктураЗапросов);
	ИначеЕсли ТипДокументаОснования = Тип("ДокументСсылка.ВводНачальныхОстатковОС") Тогда 	
		ДобавитьЗапросыДляПоступление_Остатки(СтруктураЗапросов);
	КонецЕсли;
	
	ДобавитьОбщиеЗапросы2(СтруктураЗапросов);
	
	Возврат СтруктураЗапросов;
	
КонецФункции 

Процедура ДобавитьЗапросыДляПоступление_Принятие(СтруктураЗапросов) 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПринятиеКУчетуОС.Дата КАК ДатаПринятияКУчету,
		|	ПринятиеКУчетуОС.ПодразделениеОрганизации КАК Местонахождение,
		|	ПринятиеКУчетуОС.МОЛБУ КАК МОЛ,
		|	ВЫБОР
		|		КОГДА ПринятиеКУчетуОС.КоэффициентУскоренияБУ = 0
		|			ТОГДА 1
		|		ИНАЧЕ ПринятиеКУчетуОС.КоэффициентУскоренияБУ
		|	КОНЕЦ КАК КоэффициентУскорения,
		|	ЕСТЬNULL(Соответствие_СчетУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.Международный.ОСвОрганизации)) КАК СчетУчета,
		|	ЕСТЬNULL(Соответствие_СчетАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.Международный.АмортизацияОС_01)) КАК СчетНачисленияАмортизации,
		|	ПринятиеКУчетуОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
		|	ПринятиеКУчетуОС.СпособыОтраженияРасходовПоАмортизации,
		|	ПринятиеКУчетуОС.СрокПолезногоИспользованияБУ КАК СрокПолезногоИспользования
		|ПОМЕСТИТЬ ДанныеШапкиОснования
		|ИЗ
		|	Документ.ПринятиеКУчетуОС КАК ПринятиеКУчетуОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК Соответствие_СчетУчета
		|		ПО ПринятиеКУчетуОС.СчетУчетаБУ = Соответствие_СчетУчета.СчетХозрасчетный
		|			И (Соответствие_СчетУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК Соответствие_СчетАмортизации
		|		ПО ПринятиеКУчетуОС.СчетНачисленияАмортизацииБУ = Соответствие_СчетАмортизации.СчетХозрасчетный
		|			И (Соответствие_СчетАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|ГДЕ
		|	ПринятиеКУчетуОС.Ссылка = &ДокументОснование";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаДанныеШапкиОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДанныеШапкиОснования.ДатаПринятияКУчету,
		|	ДанныеШапкиОснования.Местонахождение,
		|	ДанныеШапкиОснования.МОЛ,
		|	ДанныеШапкиОснования.КоэффициентУскорения,
		|	ДанныеШапкиОснования.СчетУчета,
		|	ДанныеШапкиОснования.СчетНачисленияАмортизации,
		|	ДанныеШапкиОснования.НачислятьАмортизацию,
		|	ДанныеШапкиОснования.СрокПолезногоИспользования,
		|	СоответствиеСчетовХозрасчетныйМСФО.СчетМеждународный КАК СчетЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто3
		|ПОМЕСТИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|ИЗ
		|	ДанныеШапкиОснования КАК ДанныеШапкиОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК СоответствиеСчетовХозрасчетныйМСФО
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|				ПО СоответствиеСчетовХозрасчетныйМСФО.СчетМеждународный = ВидыСубконтоСчетов.Счет
		|			ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СоответствиеСчетовХозрасчетныйМСФО.СчетХозрасчетный
		|				И (СоответствиеСчетовХозрасчетныйМСФО.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ПО (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
		|			И ДанныеШапкиОснования.СпособыОтраженияРасходовПоАмортизации = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ДанныеДляЗаполненияТабличнойЧасти.ДатаПринятияКУчету,
		|	ДанныеДляЗаполненияТабличнойЧасти.Местонахождение,
		|	ДанныеДляЗаполненияТабличнойЧасти.МОЛ,
		|	ДанныеДляЗаполненияТабличнойЧасти.СрокПолезногоИспользования,
		|	ДанныеДляЗаполненияТабличнойЧасти.КоэффициентУскорения,
		|	ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
		|	0 КАК Амортизация,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетУчета,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетНачисленияАмортизации,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетЗатрат,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто1,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто2,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный) КАК СчетСниженияСтоимости,
		|	ДанныеДляЗаполненияТабличнойЧасти.НачислятьАмортизацию,
		|	Счета_Коррсчет.СчетМеждународный КАК КоррСчет,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК КоррСубконто1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК КоррСубконто2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК КоррСубконто3,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).ГруппаОС КАК ГруппаОС,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).ЦельИспользования КАК ЦельИспользования
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		|			&МоментОснования,
		|			&МоментОснования,
		|			Регистратор = &ДокументОснование
		|				И СчетДт В (&СчетаУчетаБУ),
		|			,
		|			) КАК ХозрасчетныйДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК Счета_Коррсчет
		|		ПО ХозрасчетныйДвиженияССубконто.СчетКт = Счета_Коррсчет.СчетХозрасчетный
		|			И (Счета_Коррсчет.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит)),
		|	ДанныеДляЗаполненияТабличнойЧасти КАК ДанныеДляЗаполненияТабличнойЧасти";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ДанныеШапкиОснования";
		
	СтруктураЗапросов.Вставить("Поступление_Принятие_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры

Процедура ДобавитьЗапросыДляПоступление_Модернизация(СтруктураЗапросов) 
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	МодернизацияОСОС.ОсновноеСредство
		|ПОМЕСТИТЬ ОсновныеСредстваОснования
		|ИЗ
		|	Документ.МодернизацияОС.ОС КАК МодернизацияОСОС
		|ГДЕ
		|	МодернизацияОСОС.Ссылка = &ДокументОснование";
		
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаОсновныеСредстваОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.ОсновноеСредство,
		|	ОсновныеСредстваМеждународныйУчет.Организация,
		|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету,
		|	ОсновныеСредстваМеждународныйУчет.МестонахождениеОбъекта,
		|	ОсновныеСредстваМеждународныйУчет.МОЛ,
		|	ОсновныеСредстваМеждународныйУчет.Состояние,
		|	ОсновныеСредстваМеждународныйУчет.СчетУчета,
		|	ОсновныеСредстваМеждународныйУчет.СрокПолезногоИспользования,
		|	ОсновныеСредстваМеждународныйУчет.НачислятьАмортизацию,
		|	ОсновныеСредстваМеждународныйУчет.МетодНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.СчетНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.ПервоначальнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СправедливаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.ЛиквидационнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СчетЗатрат,
		|	ОсновныеСредстваМеждународныйУчет.Субконто1,
		|	ОсновныеСредстваМеждународныйУчет.Субконто2,
		|	ОсновныеСредстваМеждународныйУчет.Субконто3,
		|	ОсновныеСредстваМеждународныйУчет.ПредполагаемыйОбъемПродукции,
		|	ОсновныеСредстваМеждународныйУчет.СуммаНачисленнойАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.УбытокОтОбесценения,
		|	ОсновныеСредстваМеждународныйУчет.КоэффициентУскорения,
		|	ОсновныеСредстваМеждународныйУчет.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредствОснования
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОсновныеСредстваОснования.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК Период
		|		ИЗ
		|			ОсновныеСредстваОснования КАК ОсновныеСредстваОснования
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|				ПО ОсновныеСредстваОснования.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|					И (ОсновныеСредстваМеждународныйУчет.Период <= &Период)
		|					И (ОсновныеСредстваМеждународныйУчет.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеСредстваОснования.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|			ПО ПериодыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|				И ПериодыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|		ПО ПериодыРегистраторыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|			И ПериодыРегистраторыСреза.Регистратор = ОсновныеСредстваМеждународныйУчет.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаПараметрыОсновныхСредствОснования", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_ПоступлениеОСМОсновныеСредства.ОсновноеСредство,
		|	абс_ПоступлениеОСМОсновныеСредства.ДатаПринятияКУчету,
		|	абс_ПоступлениеОСМОсновныеСредства.Местонахождение,
		|	абс_ПоступлениеОСМОсновныеСредства.МОЛ,
		|	абс_ПоступлениеОСМОсновныеСредства.КоэффициентУскорения,
		|	ПараметрыОсновныхСредствОснования.СчетУчета,
		|	ПараметрыОсновныхСредствОснования.СчетНачисленияАмортизации,
		|	ЕСТЬNULL(ПараметрыОсновныхСредствОснования.СрокПолезногоИспользования, 0) КАК СрокПолезногоИспользования,
		|	абс_ПоступлениеОСМОсновныеСредства.НачислятьАмортизацию,
		|	абс_ПоступлениеОСМОсновныеСредства.СчетЗатрат КАК СчетЗатрат,
		|	абс_ПоступлениеОСМОсновныеСредства.Субконто1 КАК Субконто1,
		|	абс_ПоступлениеОСМОсновныеСредства.Субконто2 КАК Субконто2,
		|	абс_ПоступлениеОСМОсновныеСредства.Субконто3 КАК Субконто3
		|ПОМЕСТИТЬ ДанныеДляЗаполненияТабличнойЧасти
		|ИЗ
		|	Документ.абс_ПоступлениеОСМ.ОсновныеСредства КАК абс_ПоступлениеОСМОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредствОснования КАК ПараметрыОсновныхСредствОснования
		|		ПО абс_ПоступлениеОСМОсновныеСредства.ОсновноеСредство = ПараметрыОсновныхСредствОснования.ОсновноеСредство
		|ГДЕ
		|	абс_ПоступлениеОСМОсновныеСредства.Ссылка = &Ссылка";
		
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаДанныеДляЗаполненияТабличнойЧасти", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства) КАК ОсновноеСредство,
		|	ДанныеДляЗаполненияТабличнойЧасти.ДатаПринятияКУчету,
		|	ДанныеДляЗаполненияТабличнойЧасти.Местонахождение,
		|	ДанныеДляЗаполненияТабличнойЧасти.МОЛ,
		|	ДанныеДляЗаполненияТабличнойЧасти.СрокПолезногоИспользования,
		|	ДанныеДляЗаполненияТабличнойЧасти.КоэффициентУскорения,
		|	ХозрасчетныйДвиженияССубконто.Сумма КАК Стоимость,
		|	0 КАК Амортизация,
		|	ЕСТЬNULL(ДанныеДляЗаполненияТабличнойЧасти.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Международный.ОСвОрганизации)) КАК СчетУчета,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетНачисленияАмортизации,
		|	ДанныеДляЗаполненияТабличнойЧасти.СчетЗатрат,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто1,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто2,
		|	ДанныеДляЗаполненияТабличнойЧасти.Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный) КАК СчетСниженияСтоимости,
		|	ДанныеДляЗаполненияТабличнойЧасти.НачислятьАмортизацию,
		|	Счета_Коррсчет.СчетМеждународный КАК КоррСчет,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК КоррСубконто1,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК КоррСубконто2,
		|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК КоррСубконто3,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).ГруппаОС КАК ГруппаОС,
		|	ВЫРАЗИТЬ(ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК Справочник.ОсновныеСредства).ЦельИспользования КАК ЦельИспользования
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
		|			&МоментОснования,
		|			&МоментОснования,
		|			Регистратор = &ДокументОснование
		|				И СчетДт В (&СчетаУчетаБУ),
		|			,
		|			) КАК ХозрасчетныйДвиженияССубконто
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК Счета_Коррсчет
		|		ПО ХозрасчетныйДвиженияССубконто.СчетКт = Счета_Коррсчет.СчетХозрасчетный
		|			И (Счета_Коррсчет.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДляЗаполненияТабличнойЧасти КАК ДанныеДляЗаполненияТабличнойЧасти
		|		ПО ХозрасчетныйДвиженияССубконто.СубконтоДт1 = ДанныеДляЗаполненияТабличнойЧасти.ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_Модернизация_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ОсновныеСредстваОснования";
		
	СтруктураЗапросов.Вставить("Поступление_Модернизация_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры

Процедура ДобавитьЗапросыДляПоступление_Остатки(СтруктураЗапросов);
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство,
		|	ВводНачальныхОстатковОСОС.ДатаПринятияКУчетуРегл КАК ДатаПринятияКУчету,
		|	ВводНачальныхОстатковОСОС.Ссылка.ПодразделениеОрганизации КАК Местонахождение,
		|	ВводНачальныхОстатковОСОС.МОЛРегл КАК МОЛ,
		|	ВводНачальныхОстатковОСОС.СрокПолезногоИспользованияБУ КАК СрокПолезногоИспользования,
		|	ВводНачальныхОстатковОСОС.КоэффициентУскоренияБУ КАК КоэффициентУскорения,
		|	ВводНачальныхОстатковОСОС.ТекущаяСтоимостьБУ КАК Стоимость,
		|	ВводНачальныхОстатковОСОС.НакопленнаяАмортизацияБУ КАК Амортизация,
		|	ЕСТЬNULL(СчетаУчета.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.Международный.ОСвОрганизации)) КАК СчетУчета,
		|	ЕСТЬNULL(СчетаАмортизации.СчетМеждународный, ЗНАЧЕНИЕ(ПланСчетов.Международный.АмортизацияОС_01)) КАК СчетНачисленияАмортизации,
		|	СчетаЗатрат.СчетМеждународный КАК СчетЗатрат,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто1
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто1,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто2
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто2,
		|	ВЫБОР
		|		КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.Подразделения)
		|					ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ПодразделениеОрганизации
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат)
		|							ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СтатьяЗатрат
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы)
		|									ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.НоменклатурнаяГруппа
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОбъектыСтроительства)
		|											ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.ОбъектСтроительства
		|										ИНАЧЕ ВЫБОР
		|												КОГДА ВидыСубконтоСчетов.ВидСубконто3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.СпособыСтроительства)
		|													ТОГДА СпособыОтраженияРасходовПоАмортизацииСпособы.СпособСтроительства
		|												ИНАЧЕ СпособыОтраженияРасходовПоАмортизацииСпособы.Субконто3
		|											КОНЕЦ
		|									КОНЕЦ
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК Субконто3,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный) КАК СчетСниженияСтоимости,
		|	ВводНачальныхОстатковОСОС.НачислятьАмортизациюБУ КАК НачислятьАмортизацию,
		|	КоррСчета.СчетМеждународный КАК КоррСчет,
		|	ВводНачальныхОстатковОСОС.СубконтоБУ КАК КоррСубконто1,
		|	НЕОПРЕДЕЛЕНО КАК КоррСубконто2,
		|	НЕОПРЕДЕЛЕНО КАК КоррСубконто3,
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
		|	ВводНачальныхОстатковОСОС.ОсновноеСредство.ЦельИспользования КАК ЦельИспользования
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.ВводНачальныхОстатковОС.ОС КАК ВводНачальныхОстатковОСОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК СчетаУчета
		|		ПО ВводНачальныхОстатковОСОС.СчетУчетаБУ = СчетаУчета.СчетХозрасчетный
		|			И (СчетаУчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК СчетаАмортизации
		|		ПО (СчетаАмортизации.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|			И ВводНачальныхОстатковОСОС.СчетАмортизацииБУ = СчетаАмортизации.СчетХозрасчетный
		|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК КоррСчета
		|		ПО (КоррСчета.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Кредит))
		|			И ВводНачальныхОстатковОСОС.СчетБУ = КоррСчета.СчетХозрасчетный
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпособыОтраженияРасходовПоАмортизации.Способы КАК СпособыОтраженияРасходовПоАмортизацииСпособы
		|			ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеСчетовХозрасчетныйМСФО КАК СчетаЗатрат
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|				ПО СчетаЗатрат.СчетМеждународный = ВидыСубконтоСчетов.Счет
		|			ПО СпособыОтраженияРасходовПоАмортизацииСпособы.СчетЗатрат = СчетаЗатрат.СчетХозрасчетный
		|				И (СчетаЗатрат.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийБухгалтерии.Дебет))
		|		ПО ВводНачальныхОстатковОСОС.СпособОтраженияРасходовПоАмортизацииБУ = СпособыОтраженияРасходовПоАмортизацииСпособы.Ссылка
		|			И (СпособыОтраженияРасходовПоАмортизацииСпособы.НомерСтроки = 1)
		|ГДЕ
		|	ВводНачальныхОстатковОСОС.Ссылка = &ДокументОснование";
		
	СтруктураЗапросов.Вставить("Поступление_Остатки_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства";
		
	СтруктураЗапросов.Вставить("Поступление_Остатки_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры

Процедура ДобавитьОбщиеЗапросы1(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Международный.Ссылка КАК Счет,
		|	ЕСТЬNULL(ВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто1,
		|	ЕСТЬNULL(ВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто2,
		|	ЕСТЬNULL(ВидыСубконто3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто3
		|ПОМЕСТИТЬ ВидыСубконтоСчетов
		|ИЗ
		|	ПланСчетов.Международный КАК Международный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто1
		|		ПО Международный.Ссылка = ВидыСубконто1.Ссылка
		|			И (ВидыСубконто1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто2
		|		ПО Международный.Ссылка = ВидыСубконто2.Ссылка
		|			И (ВидыСубконто2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто3
		|		ПО Международный.Ссылка = ВидыСубконто3.Ссылка
		|			И (ВидыСубконто3.НомерСтроки = 3)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаВидыСубконтоСчетов", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетХозрасчетный КАК СчетХозрасчетный,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.ВидДвижения КАК ВидДвижения,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетМеждународный
		|ПОМЕСТИТЬ СоответствиеСчетовХозрасчетныйМСФО
		|ИЗ
		|	РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(
		|			&Период,
		|			СубконтоХозр1 В (&ПустыеСубконто)
		|				И СубконтоХозр2 В (&ПустыеСубконто)
		|				И СубконтоХозр3 В (&ПустыеСубконто)) КАК СоответствиеСчетовБУиМСФОСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетХозрасчетный,
		|	ВидДвижения";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСоответствиеСчетовХозрасчетный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаСроков.ГруппаОС КАК Перечисление.ГруппыОС) КАК ГруппаОС,
		|	ВЫРАЗИТЬ(ТаблицаСроков.ЦельИспользования КАК Справочник.ЦелиИспользования) КАК ЦельИспользования,
		|	ВЫРАЗИТЬ(ТаблицаСроков.СрокИспользования КАК ЧИСЛО(4, 0)) КАК СрокИспользования
		|ПОМЕСТИТЬ СрокиПолезногоИспользования
		|ИЗ
		|	&ТаблицаСроков КАК ТаблицаСроков
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ГруппаОС,
		|	ЦельИспользования";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСрокиПолезногоИспользования", ТекстЗапроса+";");
	
	
КонецПроцедуры

Процедура ДобавитьОбщиеЗапросы2(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСМеждународныйОстатки.ОсновноеСредство КАК ОсновноеСредство,
		|	абс_СтоимостьОСМеждународныйОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСМеждународныйОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредствДоДокумента
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСМеждународный.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
		|				И Организация = &Организация) КАК абс_СтоимостьОСМеждународныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаСтоимостьОсновныхСредствДоДокумента", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредстваМеждународныйУчет.Организация,
		|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету,
		|	ОсновныеСредстваМеждународныйУчет.МестонахождениеОбъекта,
		|	ОсновныеСредстваМеждународныйУчет.МОЛ,
		|	ОсновныеСредстваМеждународныйУчет.Состояние,
		|	ОсновныеСредстваМеждународныйУчет.СчетУчета,
		|	ОсновныеСредстваМеждународныйУчет.СрокПолезногоИспользования,
		|	ОсновныеСредстваМеждународныйУчет.НачислятьАмортизацию,
		|	ОсновныеСредстваМеждународныйУчет.МетодНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.СчетНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.ПервоначальнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СправедливаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.ЛиквидационнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СчетЗатрат,
		|	ОсновныеСредстваМеждународныйУчет.Субконто1,
		|	ОсновныеСредстваМеждународныйУчет.Субконто2,
		|	ОсновныеСредстваМеждународныйУчет.Субконто3,
		|	ОсновныеСредстваМеждународныйУчет.ПредполагаемыйОбъемПродукции,
		|	ОсновныеСредстваМеждународныйУчет.СуммаНачисленнойАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.УбытокОтОбесценения,
		|	ОсновныеСредстваМеждународныйУчет.КоэффициентУскорения,
		|	ОсновныеСредстваМеждународныйУчет.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК Период
		|		ИЗ
		|			ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|				ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|					И (ОсновныеСредстваМеждународныйУчет.Период <= &Период)
		|					И (ОсновныеСредстваМеждународныйУчет.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|			ПО ПериодыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|				И ПериодыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|		ПО ПериодыРегистраторыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|			И ПериодыРегистраторыСреза.Регистратор = ОсновныеСредстваМеждународныйУчет.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапросаОсновныеСредстваМСФОПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
		|	ВложенныйЗапрос.Стоимость + ЕСТЬNULL(СтоимостьОсновныхСредствДоДокумента.Стоимость, 0) КАК Сумма,
		|	ВложенныйЗапрос.Амортизация + ЕСТЬNULL(СтоимостьОсновныхСредствДоДокумента.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ НоваяСтоимостьОсновныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|		СУММА(ТабличнаяЧастьОсновныеСредства.Стоимость) КАК Стоимость,
		|		СУММА(ТабличнаяЧастьОсновныеСредства.Амортизация) КАК Амортизация
		|	ИЗ
		|		ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьОсновныхСредствДоДокумента КАК СтоимостьОсновныхСредствДоДокумента
		|		ПО ВложенныйЗапрос.ОсновноеСредство = СтоимостьОсновныхСредствДоДокумента.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаНоваяСтоимостьОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету) КАК ДатаПринятияКУчету,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Местонахождение) КАК Местонахождение,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.МОЛ) КАК МОЛ,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования) КАК СрокПолезногоИспользования,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения) КАК КоэффициентУскорения,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетУчета) КАК СчетУчета,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации) КАК СчетНачисленияАмортизации,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетЗатрат) КАК СчетЗатрат,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто1) КАК Субконто1,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто2) КАК Субконто2,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.Субконто3) КАК Субконто3,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости) КАК СчетСниженияСтоимости,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.НачислятьАмортизацию) КАК НачислятьАмортизацию,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ГруппаОС) КАК ГруппаОС,
		|	МАКСИМУМ(ТабличнаяЧастьОсновныеСредства.ЦельИспользования) КАК ЦельИспользования
		|ПОМЕСТИТЬ ИзменениеПараметровОсновныхСредств
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|
		|СГРУППИРОВАТЬ ПО
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаИзменениеПараметровОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ТабличнаяЧастьОсновныеСредства.Стоимость,
		|	ТабличнаяЧастьОсновныеСредства.Амортизация
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|ГДЕ
		|	(ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
		|			ИЛИ ТабличнаяЧастьОсновныеСредства.Амортизация <> 0)";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_абс_СтоимостьОСМеждународный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ИзменениеПараметровОсновныхСредств.ОсновноеСредство,
		|	&Организация,
		|	ИзменениеПараметровОсновныхСредств.ДатаПринятияКУчету,
		|	ИзменениеПараметровОсновныхСредств.Местонахождение,
		|	ИзменениеПараметровОсновныхСредств.МОЛ,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)) КАК Состояние,
		|	ИзменениеПараметровОсновныхСредств.СчетУчета,
		|	ЕСТЬNULL(СрокиПолезногоИспользования.СрокИспользования, ИзменениеПараметровОсновныхСредств.СрокПолезногоИспользования) КАК СрокПолезногоИспользования,
		|	ИзменениеПараметровОсновныхСредств.НачислятьАмортизацию,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный)) КАК МетодНачисленияАмортизации,
		|	ИзменениеПараметровОсновныхСредств.СчетНачисленияАмортизации,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.ПервоначальнаяСтоимость, ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Сумма, 0)) КАК ПервоначальнаяСтоимость,
		|	ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Сумма, 0) КАК СправедливаяСтоимость,
		|	0 КАК ЛиквидационнаяСтоимость,
		|	ИзменениеПараметровОсновныхСредств.СчетЗатрат,
		|	ИзменениеПараметровОсновныхСредств.Субконто1,
		|	ИзменениеПараметровОсновныхСредств.Субконто2,
		|	ИзменениеПараметровОсновныхСредств.Субконто3,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции, 0) КАК ПредполагаемыйОбъемПродукции,
		|	ЕСТЬNULL(НоваяСтоимостьОсновныхСредств.Амортизация, 0) КАК СуммаНачисленнойАмортизации,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
		|	ИзменениеПараметровОсновныхСредств.КоэффициентУскорения,
		|	ИзменениеПараметровОсновныхСредств.СчетСниженияСтоимости
		|ИЗ
		|	ИзменениеПараметровОсновныхСредств КАК ИзменениеПараметровОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ПО ИзменениеПараметровОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоваяСтоимостьОсновныхСредств КАК НоваяСтоимостьОсновныхСредств
		|		ПО ИзменениеПараметровОсновныхСредств.ОсновноеСредство = НоваяСтоимостьОсновныхСредств.ОсновноеСредство
		|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиПолезногоИспользования КАК СрокиПолезногоИспользования
		|		ПО ИзменениеПараметровОсновныхСредств.ГруппаОС = СрокиПолезногоИспользования.ГруппаОС
		|			И ИзменениеПараметровОсновныхСредств.ЦельИспользования = СрокиПолезногоИспользования.ЦельИспользования";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_ОсновныеСредстваМеждународныйУчет", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК СубконтоДт1,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка) КАК ВидСубконтоДт2,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка) КАК ВидСубконтоДт3,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет КАК СчетКт,
		|	ВидыСубконтоСчетов.ВидСубконто1 КАК ВидСубконтоКт1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1 КАК СубконтоКт1,
		|	ВидыСубконтоСчетов.ВидСубконто2 КАК ВидСубконтоКт2,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто2 КАК СубконтоКт2,
		|	ВидыСубконтоСчетов.ВидСубконто3 КАК ВидСубконтоКт3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто3 КАК СубконтоКт3,
		|	ТабличнаяЧастьОсновныеСредства.Стоимость КАК Сумма,
		|	&ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	ТабличнаяЧастьОсновныеСредства.Стоимость <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.КоррСчет,
		|	ВидыСубконтоСчетов.ВидСубконто1,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто1,
		|	ВидыСубконтоСчетов.ВидСубконто2,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто2,
		|	ВидыСубконтоСчетов.ВидСубконто3,
		|	ТабличнаяЧастьОсновныеСредства.КоррСубконто3,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ТабличнаяЧастьОсновныеСредства.Амортизация,
		|	&ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыСубконтоСчетов КАК ВидыСубконтоСчетов
		|		ПО ТабличнаяЧастьОсновныеСредства.КоррСчет = ВидыСубконтоСчетов.Счет
		|ГДЕ
		|	ТабличнаяЧастьОсновныеСредства.Амортизация <> 0";
		
	СтруктураЗапросов.Вставить("Поступление_ТекстЗапросаТаблица_Международный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ СтоимостьОсновныхСредствДоДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПараметрыОсновныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НоваяСтоимостьОсновныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИзменениеПараметровОсновныхСредств";
		
	СтруктураЗапросов.Вставить("Поступление_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры
